gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iom324pb_ptc.h
#define UCSR2B  _SFR_MEM8(0xD1)

#define UCSR2C  _SFR_MEM8(0xD2)

#define UCSR2D  _SFR_MEM8(0xD3)

/* Combine UBRR2L and UBRR2H */
#define UBRR2   _SFR_MEM16(0xD4)

#define UBRR2L  _SFR_MEM8(0xD4)
#define UBRR2H  _SFR_MEM8(0xD5)

#define UDR2    _SFR_MEM8(0xD6)

/* Reserved [0xD7] */

#define TWBR1   _SFR_MEM8(0xD8)

#define TWSR1   _SFR_MEM8(0xD9)

#define TWAR1   _SFR_MEM8(0xDA)

#define TWDR1   _SFR_MEM8(0xDB)

#define TWCR1   _SFR_MEM8(0xDC)

#define TWAMR1  _SFR_MEM8(0xDD)
#define TWAM10  1
#define TWAM11  2
#define TWAM12  3
#define TWAM13  4
#define TWAM14  5
#define TWAM15  6
#define TWAM16  7

/* Reserved [0xDE..0xDF] */

#define PTCRA   _SFR_MEM8(0xE0)
#define ENABLE  1
#define ADRS    2
#define FREERUN 3
#define LOWPOWER 4

#define PTCRB   _SFR_MEM8(0xE1)
#define PRSC0   0
#define PRSC1   1
#define WINCM0  4
#define WINCM1  5
#define WINCM2  6
#define WINSS   7

#define PTCRC   _SFR_MEM8(0xE2)
#define CTSM0   0
#define CTSM1   1
#define CTSM2   2
#define CTSM3   3

#define PTCRD   _SFR_MEM8(0xE3)
#define SDS0    0
#define SDS1    1
#define SDS2    2
#define SDS3    3
#define ASDV    4
#define CCDS0   5
#define CCDS1   6

#define PTCRE   _SFR_MEM8(0xE4)
#define ADAS0   0
#define ADAS1   1
#define ADAS2   2
#define RSEL0   4
#define RSEL1   5

#define PTCCCRA _SFR_MEM8(0xE5)
#define CCA0    0
#define CCA1    1
#define CCA2    2
#define CCA3    3
#define CCF0    4
#define CCF1    5
#define CCF2    6
#define CCF3    7

#define PTCCCRB _SFR_MEM8(0xE6)
#define CCC0    0
#define CCC1    1
#define CCC2    2
#define CCC3    3
#define CCR0    4
#define CCR1    5

#define PTCICR  _SFR_MEM8(0xE7)
#define CIF0    0
#define CIF1    1
#define CIF2    2
#define CIF3    3
#define CIC0    4
#define CIC1    5

#define PTCSD   _SFR_MEM8(0xE8)
#define CSD0    0
#define CSD1    1
#define CSD2    2
#define CSD3    3
#define CSD4    4
#define CSD5    5
#define CSD6    6
#define CSD7    7

#define PTTRIG  _SFR_MEM8(0xE9)
#define STCONV  0
#define TRIGSRC0 4
#define TRIGSRC1 5
#define TRIGSRC2 6
#define TRIGSRC3 7

/* Reserved [0xEA..0xEB] */

#define PTRESSL _SFR_MEM8(0xEC)
#define RESSL0  0
#define RESSL1  1
#define RESSL2  2
#define RESSL3  3
#define RESSL4  4
#define RESSL5  5
#define RESSL6  6
#define RESSL7  7

#define PTRESSH _SFR_MEM8(0xED)
#define RESSH0  0
#define RESSH1  1

#define PTRESL  _SFR_MEM8(0xEE)
#define RESL0   0
#define RESL1   1
#define RESL2   2
#define RESL3   3
#define RESL4   4
#define RESL5   5
#define RESL6   6
#define RESL7   7

#define PTRESH  _SFR_MEM8(0xEF)
#define RESH0   0
#define RESH1   1
#define RESH2   2
#define RESH3   3
#define RESH4   4
#define RESH5   5
#define RESH6   6
#define RESH7   7

#define PTXENL  _SFR_MEM8(0xF0)
#define XENL0   0
#define XENL1   1
#define XENL2   2
#define XENL3   3
#define XENL4   4
#define XENL5   5
#define XENL6   6
#define XENL7   7

#define PTXENH  _SFR_MEM8(0xF1)
#define XENH0   0
#define XENH1   1
#define XENH2   2
#define XENH3   3
#define XENH4   4
#define XENH5   5
#define XENH6   6
#define XENH7   7

#define PTXSELL _SFR_MEM8(0xF2)
#define XSELL0  0
#define XSELL1  1
#define XSELL2  2
#define XSELL3  3
#define XSELL4  4
#define XSELL5  5
#define XSELL6  6
#define XSELL7  7

#define PTXSELH _SFR_MEM8(0xF3)
#define XSELH0  0
#define XSELH1  1
#define XSELH2  2
#define XSELH3  3
#define XSELH4  4
#define XSELH5  5
#define XSELH6  6
#define XSELH7  7

#define PTYEN0  _SFR_MEM8(0xF4)
#define YEN00   0
#define YEN01   1
#define YEN02   2
#define YEN03   3
#define YEN04   4
#define YEN05   5
#define YEN06   6
#define YEN07   7

#define PTYEN1  _SFR_MEM8(0xF5)
#define YEN10   0
#define YEN11   1
#define YEN12   2
#define YEN13   3
#define YEN14   4
#define YEN15   5
#define YEN16   6
#define YEN17   7

#define PTYEN2  _SFR_MEM8(0xF6)
#define YEN20   0
#define YEN21   1
#define YEN22   2
#define YEN23   3
#define YEN24   4
#define YEN25   5
#define YEN26   6
#define YEN27   7

#define PTYEN3  _SFR_MEM8(0xF7)
#define YEN30   0
#define YEN31   1
#define YEN32   2
#define YEN33   3
#define YEN34   4
#define YEN35   5
#define YEN36   6
#define YEN37   7

#define PTYSEL0 _SFR_MEM8(0xF8)
#define YSEL00  0
#define YSEL01  1
#define YSEL02  2
#define YSEL03  3
#define YSEL04  4
#define YSEL05  5
#define YSEL06  6
#define YSEL07  7

#define PTYSEL1 _SFR_MEM8(0xF9)
#define YSEL10  0
#define YSEL11  1
#define YSEL12  2
#define YSEL13  3
#define YSEL14  4
#define YSEL15  5
#define YSEL16  6
#define YSEL17  7

#define PTYSEL2 _SFR_MEM8(0xFA)
#define YSEL20  0
#define YSEL21  1
#define YSEL22  2
#define YSEL23  3
#define YSEL24  4
#define YSEL25  5
#define YSEL26  6
#define YSEL27  7

#define PTYSEL3 _SFR_MEM8(0xFB)
#define YSEL30  0
#define YSEL31  1
#define YSEL32  2
#define YSEL33  3
#define YSEL34  4
#define YSEL35  5
#define YSEL36  6
#define YSEL37  7

#define PTWINLTL _SFR_MEM8(0xFC)
#define WINLTL0 0
#define WINLTL1 1
#define WINLTL2 2
#define WINLTL3 3
#define WINLTL4 4
#define WINLTL5 5
#define WINLTL6 6
#define WINLTL7 7

#define PTWINLTH _SFR_MEM8(0xFD)
#define WINLTH0 0
#define WINLTH1 1
#define WINLTH2 2
#define WINLTH3 3
#define WINLTH4 4
#define WINLTH5 5
#define WINLTH6 6
#define WINLTH7 7

#define PTWINHTL _SFR_MEM8(0xFE)
#define WINHTL0 0
#define WINHTL1 1
#define WINHTL2 2
#define WINHTL3 3
#define WINHTL4 4
#define WINHTL5 5
#define WINHTL6 6
#define WINHTL7 7

#define PTWINHTH _SFR_MEM8(0xFF)
#define WINHTH0 0
#define WINHTH1 1
#define WINHTH2 2
#define WINHTH3 3
#define WINHTH4 4
#define WINHTH5 5
#define WINHTH6 6
#define WINHTH7 7



/* Values and associated defines */


#define SLEEP_MODE_IDLE (0x00<<1)
#define SLEEP_MODE_ADC (0x01<<1)
#define SLEEP_MODE_PWR_DOWN (0x02<<1)
#define SLEEP_MODE_PWR_SAVE (0x03<<1)
#define SLEEP_MODE_STANDBY (0x06<<1)
#define SLEEP_MODE_EXT_STANDBY (0x07<<1)

/* Interrupt vectors */
/* Vector 0 is the reset vector */
/* External Interrupt Request 0 */
#define INT0_vect            _VECTOR(1)
#define INT0_vect_num        1

/* External Interrupt Request 1 */
#define INT1_vect            _VECTOR(2)
#define INT1_vect_num        2

/* External Interrupt Request 2 */
#define INT2_vect            _VECTOR(3)
#define INT2_vect_num        3

/* Pin Change Interrupt Request 0 */
#define PCINT0_vect            _VECTOR(4)
#define PCINT0_vect_num        4

/* Pin Change Interrupt Request 1 */
#define PCINT1_vect            _VECTOR(5)
#define PCINT1_vect_num        5

