gnoejh/soc3050code/tools/avr-toolchain/avr/include/avr/iom324pb_ptc.h
/* Pin Change Interrupt Request 2 */
#define PCINT2_vect            _VECTOR(6)
#define PCINT2_vect_num        6

/* Pin Change Interrupt Request 3 */
#define PCINT3_vect            _VECTOR(7)
#define PCINT3_vect_num        7

/* Watchdog Time-out Interrupt */
#define WDT_vect            _VECTOR(8)
#define WDT_vect_num        8

/* Timer/Counter2 Compare Match A */
#define TIMER2_COMPA_vect            _VECTOR(9)
#define TIMER2_COMPA_vect_num        9

/* Timer/Counter2 Compare Match B */
#define TIMER2_COMPB_vect            _VECTOR(10)
#define TIMER2_COMPB_vect_num        10

/* Timer/Counter2 Overflow */
#define TIMER2_OVF_vect            _VECTOR(11)
#define TIMER2_OVF_vect_num        11

/* Timer/Counter1 Capture Event */
#define TIMER1_CAPT_vect            _VECTOR(12)
#define TIMER1_CAPT_vect_num        12

/* Timer/Counter1 Compare Match A */
#define TIMER1_COMPA_vect            _VECTOR(13)
#define TIMER1_COMPA_vect_num        13

/* Timer/Counter1 Compare Match B */
#define TIMER1_COMPB_vect            _VECTOR(14)
#define TIMER1_COMPB_vect_num        14

/* Timer/Counter1 Overflow */
#define TIMER1_OVF_vect            _VECTOR(15)
#define TIMER1_OVF_vect_num        15

/* Timer/Counter0 Compare Match A */
#define TIMER0_COMPA_vect            _VECTOR(16)
#define TIMER0_COMPA_vect_num        16

/* Timer/Counter0 Compare Match B */
#define TIMER0_COMPB_vect            _VECTOR(17)
#define TIMER0_COMPB_vect_num        17

/* Timer/Counter0 Overflow */
#define TIMER0_OVF_vect            _VECTOR(18)
#define TIMER0_OVF_vect_num        18

/* SPI0 Serial Transfer Complete */
#define SPI0_STC_vect            _VECTOR(19)
#define SPI0_STC_vect_num        19

/* USART0 Rx Complete */
#define USART0_RX_vect            _VECTOR(20)
#define USART0_RX_vect_num        20

/* USART0 Data register Empty */
#define USART0_UDRE_vect            _VECTOR(21)
#define USART0_UDRE_vect_num        21

/* USART0 Tx Complete */
#define USART0_TX_vect            _VECTOR(22)
#define USART0_TX_vect_num        22

/* Analog Comparator */
#define ANALOG_COMP_vect            _VECTOR(23)
#define ANALOG_COMP_vect_num        23

/* ADC Conversion Complete */
#define ADC_vect            _VECTOR(24)
#define ADC_vect_num        24

/* EEPROM Ready */
#define EE_READY_vect            _VECTOR(25)
#define EE_READY_vect_num        25

/* 2-wire Serial Interface 0 */
#define TWI0_vect            _VECTOR(26)
#define TWI0_vect_num        26

/* Store Program Memory Read */
#define SPM_READY_vect            _VECTOR(27)
#define SPM_READY_vect_num        27

/* USART1 RX complete */
#define USART1_RX_vect            _VECTOR(28)
#define USART1_RX_vect_num        28

/* USART1 Data Register Empty */
#define USART1_UDRE_vect            _VECTOR(29)
#define USART1_UDRE_vect_num        29

/* USART1 TX complete */
#define USART1_TX_vect            _VECTOR(30)
#define USART1_TX_vect_num        30

/* Timer/Counter3 Capture Event */
#define TIMER3_CAPT_vect            _VECTOR(31)
#define TIMER3_CAPT_vect_num        31

/* Timer/Counter3 Compare Match A */
#define TIMER3_COMPA_vect            _VECTOR(32)
#define TIMER3_COMPA_vect_num        32

/* Timer/Counter3 Compare Match B */
#define TIMER3_COMPB_vect            _VECTOR(33)
#define TIMER3_COMPB_vect_num        33

/* Timer/Counter3 Overflow */
#define TIMER3_OVF_vect            _VECTOR(34)
#define TIMER3_OVF_vect_num        34

/* USART0 RX start edge detect */
#define USART0_RXS_vect            _VECTOR(35)
#define USART0_RXS_vect_num        35

/* USART0 RX start edge detect */
#define USART0_START_vect            _VECTOR(35)
#define USART0_START_vect_num        35

/* USART1 RX start edge detect */
#define USART1_RXS_vect            _VECTOR(36)
#define USART1_RXS_vect_num        36

/* USART1 RX start edge detect */
#define USART1_START_vect            _VECTOR(36)
#define USART1_START_vect_num        36

/* Pin Change Interrupt Request 4 */
#define PCINT4_vect            _VECTOR(37)
#define PCINT4_vect_num        37

/* Crystal failure detect */
#define XOSCFD_vect            _VECTOR(38)
#define XOSCFD_vect_num        38

/* PTC end of conversion */
#define PTC_EOC_vect            _VECTOR(39)
#define PTC_EOC_vect_num        39

/* PTC window comparator interrupt */
#define PTC_WCOMP_vect            _VECTOR(40)
#define PTC_WCOMP_vect_num        40

/* SPI1 Serial Transfer Complete */
#define SPI1_STC_vect            _VECTOR(41)
#define SPI1_STC_vect_num        41

/* 2-wire Serial Interface 1 */
#define TWI1_vect            _VECTOR(42)
#define TWI1_vect_num        42

/* Timer/Counter4 Capture Event */
#define TIMER4_CAPT_vect            _VECTOR(43)
#define TIMER4_CAPT_vect_num        43

/* Timer/Counter4 Compare Match A */
#define TIMER4_COMPA_vect            _VECTOR(44)
#define TIMER4_COMPA_vect_num        44

/* Timer/Counter4 Compare Match B */
#define TIMER4_COMPB_vect            _VECTOR(45)
#define TIMER4_COMPB_vect_num        45

/* Timer/Counter4 Overflow */
#define TIMER4_OVF_vect            _VECTOR(46)
#define TIMER4_OVF_vect_num        46

/* USART2 Rx Complete */
#define USART2_RX_vect            _VECTOR(47)
#define USART2_RX_vect_num        47

/* USART2 Data register Empty */
#define USART2_UDRE_vect            _VECTOR(48)
#define USART2_UDRE_vect_num        48

/* USART2 Tx Complete */
#define USART2_TX_vect            _VECTOR(49)
#define USART2_TX_vect_num        49

/* USART2 RX start edge detect */
#define USART2_RXS_vect            _VECTOR(50)
#define USART2_RXS_vect_num        50

/* USART2 RX start edge detect */
#define USART2_START_vect            _VECTOR(50)
#define USART2_START_vect_num        50

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define _VECTORS_SIZE 204
#else
#  define _VECTORS_SIZE 204U
#endif


/* Constants */

#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define SPM_PAGESIZE 128
#  define FLASHSTART   0x0000
#  define FLASHEND     0x7FFF
#else
#  define SPM_PAGESIZE 128U
#  define FLASHSTART   0x0000U
#  define FLASHEND     0x7FFFU
#endif
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define RAMSTART     0x0100
#  define RAMSIZE      2048
#  define RAMEND       0x08FF
#else
#  define RAMSTART     0x0100U
#  define RAMSIZE      2048U
#  define RAMEND       0x08FFU
#endif
#if (defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#  define E2START     0
#  define E2SIZE      1024
#  define E2PAGESIZE  4
#  define E2END       0x03FF
#else
#  define E2START     0U
#  define E2SIZE      1024U
#  define E2PAGESIZE  4U
#  define E2END       0x03FFU
#endif
#define XRAMEND      RAMEND


